JuneJulyAugust/openotter/firmware/stm32-mcp/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "ble_app.h"
#include "ble_tof.h"
#include "stm32l4xx_ll_pwr.h"
#include "stm32l4xx_ll_rcc.h"
#include "tof_l8.h"
#include "firmware_watchdog.h"
#include "firmware_stack_guard.h"
#include "firmware_panic.h"
#include "firmware_mpu.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
DFSDM_Channel_HandleTypeDef hdfsdm1_channel1;

I2C_HandleTypeDef hi2c2;
I2C_HandleTypeDef hi2c3;

QSPI_HandleTypeDef hqspi;

TIM_HandleTypeDef htim3;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart3;

PCD_HandleTypeDef hpcd_USB_OTG_FS;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DFSDM1_Init(void);
static void MX_I2C2_Init(void);
static void MX_I2C3_Init(void);
static void MX_QUADSPI_Init(void);
static void MX_TIM3_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_USB_OTG_FS_PCD_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

#include <stdarg.h>
#include <stdio.h>
#include <string.h>

static uint32_t s_boot_reset_flags;

static void boot_log_prefix(void)
{
  char buf[16];
  int n = snprintf(buf, sizeof(buf), "[%lu] ",
                   (unsigned long)HAL_GetTick());
  if (n > 0) {
    HAL_UART_Transmit(&huart1, (uint8_t *)buf, (uint16_t)n, 100);
  }
}

static void boot_log_str(const char *s)
{
  boot_log_prefix();
  HAL_UART_Transmit(&huart1, (const uint8_t *)s, (uint16_t)strlen(s), 100);
}

static void boot_log_fmt(const char *fmt, ...)
{
  char buf[160];
  va_list ap;
  va_start(ap, fmt);
  int n = vsnprintf(buf, sizeof(buf), fmt, ap);
  va_end(ap);
  if (n > 0) {
    boot_log_prefix();
    HAL_UART_Transmit(&huart1, (uint8_t *)buf, (uint16_t)n, 100);
  }
}

static void boot_log_reset_cause(uint32_t flags)
{
  boot_log_fmt("BOOT reset_csr=0x%08lX cause=%s%s%s%s%s%s%s\r\n",
      (unsigned long)flags,
      (flags & RCC_CSR_LPWRRSTF) ? "LPWR " : "",
      (flags & RCC_CSR_WWDGRSTF) ? "WWDG " : "",
      (flags & RCC_CSR_IWDGRSTF) ? "IWDG " : "",
      (flags & RCC_CSR_SFTRSTF)  ? "SFT "  : "",
      (flags & RCC_CSR_BORRSTF)  ? "BOR "  : "",
      (flags & RCC_CSR_PINRSTF)  ? "PIN "  : "",
      (flags & RCC_CSR_OBLRSTF)  ? "OBL "  : "");
}
/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void) {

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick.
   */
  HAL_Init();

  /* USER CODE BEGIN Init */
  __HAL_RCC_PWR_CLK_ENABLE();

  /* Snapshot reset cause flags BEFORE __HAL_RCC_CLEAR_RESET_FLAGS so the
   * boot log can print why we just rebooted. */
  s_boot_reset_flags = RCC->CSR;

  /*
   * Reset the RTC backup domain on pin-reset so stale RTC wakeup state
   * from a previous run cannot hang the Timer Server initialization.
   * This matches the reference P2P_LedButton example.
   */
  if (LL_RCC_IsActiveFlag_PINRST() != RESET) {
    LL_PWR_ClearFlag_SB();
    HAL_PWR_EnableBkUpAccess();
    HAL_PWR_EnableBkUpAccess();
    LL_RCC_ForceBackupDomainReset();
    __HAL_RCC_CLEAR_RESET_FLAGS();
    LL_RCC_ReleaseBackupDomainReset();
  }
  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DFSDM1_Init();
  MX_I2C2_Init();
  MX_I2C3_Init();
  MX_QUADSPI_Init();
  /* SPI3 is owned by the BLE middleware (hw_spi.c) — do NOT init here */
  MX_TIM3_Init();
  MX_USART1_UART_Init();
  MX_USART3_UART_Init();
  MX_USB_OTG_FS_PCD_Init();
  /* USER CODE BEGIN 2 */
  /* First UART line of every boot. Establishes log baseline + tells us
   * exactly why we just rebooted (NRST button, IWDG, software, BOR, etc). */
  boot_log_str("\r\n=== OpenOtter STM32 boot ===\r\n");
  boot_log_reset_cause(s_boot_reset_flags);
  boot_log_fmt("BOOT phase=peripherals_done tick=%lu\r\n",
               (unsigned long)HAL_GetTick());
  /* LD1 (PA5) heartbeat LED */
  {
    GPIO_InitTypeDef led = {0};
    led.Pin = GPIO_PIN_5;
    led.Mode = GPIO_MODE_OUTPUT_PP;
    led.Pull = GPIO_NOPULL;
    led.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOA, &led);
  }

  /* Start TIM3 PWM on CH1 (throttle PB4) and CH4 (steering PB1) */
  HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1);
  HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_4);

  /* VL53L8CX is initialized lazily from BLE_Tof_Process so the multi-second
   * sensor firmware download cannot block BLE advertising or the heartbeat LED
   * before the main loop starts.
   */

  /* Initialize BLE stack and custom GATT service */
  boot_log_str("BOOT phase=ble_app_init\r\n");
  BLE_App_Init(&htim3);

